Revit 2024 API
WireSize.InUse Property
 Get or set whether the size can be used in sizing.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool InUse { get; set; }
Visual Basic
Public Property InUse As Boolean
	Get
	Set
Visual C++
public:
property bool InUse {
	bool get ();
	void set (bool value);
}
See Also
WireSize Class
Autodesk.Revit.DB.Electrical Namespace